//
// 请注意：bbsmax 不是一个免费产品，源代码仅限用于学习，禁止用于商业站点或者其他商业用途
// 如果您要将bbsmax用于商业用途，需要从官方购买商业授权，得到授权后可以基于源代码二次开发
//
// 版权所有 厦门麦斯网络科技有限公司
// 公司网站 www.bbsmax.com
//

//Author:		周杨思/Andrew Chow
//Date:			2006/1/29
//Description:
//				和论坛有关的枚举
//------------------------------------------------------------------------------

//Amendment history:
//------------------------------------------------------------------------------
//Datetime		Modified by		Checked by		Summary
//------------------------------------------------------------------------------
//yyyy/MM/DD	周杨思							
//------------------------------------------------------------------------------
using System;

namespace MaxLabs.bbsMax.Enums
{
    public enum TimeFormat
    {
        Default = -1,
        /// <summary>
        /// 默认值：小时:分(24小时制)
        /// </summary>
        hhmm = 0,

        /// <summary>
        /// 小时:分:秒(24小时制)
        /// </summary>
        hhmmss = 1,

        /// <summary>
        /// 小时:分 上下午(12小时制)
        /// </summary>
        hhmmtt = 2,

        /// <summary>
        /// 小时:分:秒 上下午(12小时制)
        /// </summary>
        hhmmsstt = 3

    }
}